# Задача-1:
# Дан список фруктов.
# Напишите программу, выводящую фрукты в виде нумерованного списка,
# выровненного по правой стороне.

# Пример:
# Дано: ["яблоко", "банан", "киви", "арбуз"]
# Вывод:
# 1. яблоко
# 2.  банан
# 3.   киви
# 4.  арбуз

# Подсказка: воспользоваться методом .format()

print("\nЗадача-1\n")

friuts = ["яблоко", "банан", "киви", "арбуз"]

maxLen = 0
for friut in friuts:
    if len(friut) > maxLen:
        maxLen = len(friut)

i = 1
formatStr = "{}.{:>" + str(maxLen+1) + "}"
for friut in friuts:
    print(formatStr.format(i, friut))
    i += 1

# Задача-2:
# Даны два произвольные списка.
# Удалите из первого списка элементы, присутствующие во втором списке.


# Задача-3:
# Дан произвольный список из целых чисел.
# Получите НОВЫЙ список из элементов исходного, выполнив следующие условия:
# если элемент кратен двум, то разделить его на 4, если не кратен, то умножить на два.
